{
  "title": "Lesson 1: Greetings & Introductions",
  "avatarScript": "¡Hola! Bienvenido a tu primera clase de inglés. Me alegra mucho acompañarte en este viaje. Hoy aprenderemos a saludar, a decir nuestro nombre y a comenzar una conversación sencilla. No te preocupes si te equivocas, lo importante es practicar. ¿Estás listo? ¡Vamos allá!",
  "dialog": [

    {
      "text": "Comenzamos con los saludos básicos. En inglés, para decir 'Hola', usamos la palabra: Hello. Escucha cómo suena: Hello. Ahora tú, repite conmigo: Hello.",
      "expectedResponse": "Hello"
    },
    {
      "text": "Muy bien. Una vez más, con confianza: Hello.",
      "expectedResponse": "Hello"
    },
    {
      "text": "Si estás saludando por la mañana, puedes decir: Good morning. Intenta repetirlo: Good morning.",
      "expectedResponse": "Good morning"
    },
    {
      "text": "¿Y por la tarde? Decimos: Good afternoon. Repite conmigo: Good afternoon.",
      "expectedResponse": "Good afternoon"
    },
    {
      "text": "Por la noche, usamos: Good evening. Una vez más: Good evening.",
      "expectedResponse": "Good evening"
    },

    {
      "text": "Muy bien. Ahora vamos a aprender cómo presentarnos. Para decir 'Mi nombre es', en inglés decimos: My name is... Repítelo conmigo: My name is.",
      "expectedResponse": "My name is"
    },
    {
      "text": "Perfecto. Ahora agrega tu nombre. Por ejemplo, si te llamas Laura: My name is Laura. Intenta repetirlo: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Muy bien. Ahora escucha cómo suena en una frase completa: Hello, my name is Laura.",
      "expectedResponse": "Hello, my name is Laura"
    },
    {
      "text": "Tu turno. Repite toda la frase: Hello, my name is Laura.",
      "expectedResponse": "Hello, my name is Laura"
    },
    {
      "text": "Ahora vamos a practicar un pequeño diálogo. Yo digo: Hello! Y tú respondes: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Muy bien. Ahora yo digo: My name is John. ¿Cómo responderías tú usando tu nombre?",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "¡Excelente! También puedes decirlo de forma más corta: I am Laura. Repítelo: I am Laura.",
      "expectedResponse": "I am Laura"
    },
    {
      "text": "Y si quieres sonar aún más natural, puedes usar la contracción: I’m Laura. Repite: I’m Laura.",
      "expectedResponse": "I’m Laura"
    },

    {
      "text": "Para decir 'Mucho gusto', en inglés usamos: Nice to meet you. Es una frase muy útil. Repite: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },
    {
      "text": "Ahora construyamos una frase completa. Por ejemplo: Hello, I’m Laura. Nice to meet you.",
      "expectedResponse": "Hello, I’m Laura. Nice to meet you"
    },

    {
      "text": "Vamos a repasar todo el diálogo paso a paso. Primero: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Luego: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Y por último: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },
    {
      "text": "¡Ahora cambiamos los roles! Tú empiezas. Dime: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Ahora preséntate: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Y termina con: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },

    {
      "text": "¡Lo has hecho genial! Has aprendido a saludar, presentarte y comenzar una conversación sencilla en inglés. Recuerda que la práctica hace al maestro. ¡Nos vemos en la próxima lección!",
      "expectedResponse": ""
    }
  ]
}
