{
  "title": "Lesson 1: Greetings & Introductions",
  "avatarScript": "¡Hola y bienvenido a tu primera clase de inglés! Hoy aprenderás a saludar, presentarte y empezar una conversación sencilla. Repite después de mí, practica con seguridad y prepárate para divertirte.",
  "dialog": [
    {
      "text": "Empecemos por lo más importante: saludar. En inglés, 'Hola' se dice: Hello. Repite conmigo: Hello.",
      "expectedResponse": "Hello"
    },
    {
      "text": "Muy bien. Ahora, escúchalo de nuevo: Hello. Inténtalo otra vez: Hello.",
      "expectedResponse": "Hello"
    },
    {
      "text": "¿Y si quieres ser más formal por la mañana? Puedes decir: Good morning. Repite: Good morning.",
      "expectedResponse": "Good morning"
    },
    {
      "text": "Ahora por la tarde: Good afternoon. Inténtalo tú: Good afternoon.",
      "expectedResponse": "Good afternoon"
    },
    {
      "text": "Y por la noche, decimos: Good evening. Repite: Good evening.",
      "expectedResponse": "Good evening"
    },
    {
      "text": "Muy bien. Ahora pasemos a las presentaciones. Para decir 'Mi nombre es...', decimos: My name is... Repite: My name is.",
      "expectedResponse": "My name is"
    },
    {
      "text": "Agrega tu nombre. Por ejemplo: My name is Laura. Inténtalo tú: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "¡Excelente! Ahora, escúchame decir: Hello, my name is Laura.",
      "expectedResponse": "Hello, my name is Laura"
    },
    {
      "text": "Intenta repetir toda la frase tú: Hello, my name is Laura.",
      "expectedResponse": "Hello, my name is Laura"
    },
    {
      "text": "Ahora vamos a practicar un pequeño diálogo. Yo diré: Hello! Y tú respondes lo mismo: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Ahora yo digo: My name is John. ¿Cómo respondes tú con tu nombre?",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Muy bien. También puedes decir: I am Laura. Repite: I am Laura.",
      "expectedResponse": "I am Laura"
    },
    {
      "text": "Otra forma de responder es: I’m Laura. Es una forma corta de 'I am'. Repite: I’m Laura.",
      "expectedResponse": "I’m Laura"
    },
    {
      "text": "¿Cómo se dice 'Mucho gusto'? Se dice: Nice to meet you. Repite: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },
    {
      "text": "Ahora la frase completa: Hello, I’m Laura. Nice to meet you.",
      "expectedResponse": "Hello, I’m Laura. Nice to meet you"
    },
    {
      "text": "Muy bien. Ahora repite el diálogo completo tú solo. Primero: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Después: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Y al final: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },
    {
      "text": "¡Excelente! Ahora cambiamos roles. Tú me dices: Hello!",
      "expectedResponse": "Hello"
    },
    {
      "text": "Luego me dices tu nombre: My name is Laura.",
      "expectedResponse": "My name is Laura"
    },
    {
      "text": "Y terminas con: Nice to meet you.",
      "expectedResponse": "Nice to meet you"
    },
    {
      "text": "¡Lo hiciste genial! Ahora puedes saludar, presentarte y comenzar una conversación simple en inglés. ¡Nos vemos en la próxima lección!",
      "expectedResponse": ""
    }
  ]
}
